import { YearLists, GenreLists } from '../types/types'
// Массив годов
export const YEARS_LIST: YearLists[] = [
  'до 1980',
  '1980-1989',
  '1990-1999',
  '2000-2009',
  '2010-2019',
  '2020',
  '2021',
  '2022',
  '2023',
  '2024'
]

// Массив жанров
export const GENRES_LIST: GenreLists[] = [
  { id: 28, name: 'Боевик' },
  { id: 12, name: 'Приключения' },
  { id: 16, name: 'Анимация' },
  { id: 35, name: 'Комедия' },
  { id: 80, name: 'Криминал' },
  { id: 18, name: 'Драма' },
  { id: 10751, name: 'Семейный' },
  { id: 14, name: 'Фэнтези' },
  { id: 36, name: 'Исторический' },
  { id: 27, name: 'Ужасы' },
  { id: 10402, name: 'Музыка' },
  { id: 9648, name: 'Детектив' },
  { id: 10749, name: 'Романтика' },
  { id: 878, name: 'Научная фантастика' },
  { id: 10770, name: 'ТВ шоу' },
  { id: 53, name: 'Триллер' },
  { id: 10752, name: 'Военный' },
  { id: 37, name: 'Вестерн' }
]

// Массив стран
export const COUNTRIES_LIST: string[] = [
  'США',
  'Великобритания',
  'Франция',
  'Германия',
  'Япония',
  'Китай',
  'Индия',
  'Россия'
]
